In [1]:
'''
CSV ==> comma seperated Values.... fileName.csv

LIST
TUPLE
DICT

'''
d = {"Country":['Pakistan','India','Iran','China','Russia','Nepal','Afghanistan'],
    'Capital':['Islamabad','Delhi','Tehran','Bejing','Mascow','Khatmundo','Kabul'],
    'Population':[24.5,127.4,21.6,175.6,67.2,17.5,9.67]}

In [2]:
d

{'Country': ['Pakistan',
  'India',
  'Iran',
  'China',
  'Russia',
  'Nepal',
  'Afghanistan'],
 'Capital': ['Islamabad',
  'Delhi',
  'Tehran',
  'Bejing',
  'Mascow',
  'Khatmundo',
  'Kabul'],
 'Population': [24.5, 127.4, 21.6, 175.6, 67.2, 17.5, 9.67]}

In [3]:
#PANDAS
import pandas as pd

In [4]:
#Series -- 1D -- LIST ............
#DataFrame -- 2D
df = pd.DataFrame(d)

In [5]:
df

       Country    Capital  Population
0     Pakistan  Islamabad       24.50
1        India      Delhi      127.40
2         Iran     Tehran       21.60
3        China     Bejing      175.60
4       Russia     Mascow       67.20
5        Nepal  Khatmundo       17.50
6  Afghanistan      Kabul        9.67

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     7 non-null      object
 1   Capital     7 non-null      object
 2   Population  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [7]:
df.describe()

       Population
count    7.000000
mean    63.352857
std     64.489582
min      9.670000
25%     19.550000
50%     24.500000
75%     97.300000
max    175.600000

In [8]:
df

       Country    Capital  Population
0     Pakistan  Islamabad       24.50
1        India      Delhi      127.40
2         Iran     Tehran       21.60
3        China     Bejing      175.60
4       Russia     Mascow       67.20
5        Nepal  Khatmundo       17.50
6  Afghanistan      Kabul        9.67

In [9]:
df.index = ['PK','IN','IR','CN','RS','NL','AF']

In [10]:
df.head()

     Country    Capital  Population
PK  Pakistan  Islamabad        24.5
IN     India      Delhi       127.4
IR      Iran     Tehran        21.6
CN     China     Bejing       175.6
RS    Russia     Mascow        67.2

In [12]:
df.head(6)

     Country    Capital  Population
PK  Pakistan  Islamabad        24.5
IN     India      Delhi       127.4
IR      Iran     Tehran        21.6
CN     China     Bejing       175.6
RS    Russia     Mascow        67.2
NL     Nepal  Khatmundo        17.5

In [13]:
df

        Country    Capital  Population
PK     Pakistan  Islamabad       24.50
IN        India      Delhi      127.40
IR         Iran     Tehran       21.60
CN        China     Bejing      175.60
RS       Russia     Mascow       67.20
NL        Nepal  Khatmundo       17.50
AF  Afghanistan      Kabul        9.67

In [14]:
df.to_csv('pbdG.csv',sep=',')

In [17]:
#how to read a csv file.....
f = pd.read_csv('pbdG.csv',index_col=0)

In [18]:
f

        Country    Capital  Population
PK     Pakistan  Islamabad       24.50
IN        India      Delhi      127.40
IR         Iran     Tehran       21.60
CN        China     Bejing      175.60
RS       Russia     Mascow       67.20
NL        Nepal  Khatmundo       17.50
AF  Afghanistan      Kabul        9.67

In [19]:
f.iloc[3]

Country        China
Capital       Bejing
Population     175.6
Name: CN, dtype: object

In [20]:
f.iloc[3][2]

175.6

In [21]:
f.iloc[3][0]

'China'

In [22]:
f.loc['CN']

Country        China
Capital       Bejing
Population     175.6
Name: CN, dtype: object

In [23]:
f

        Country    Capital  Population
PK     Pakistan  Islamabad       24.50
IN        India      Delhi      127.40
IR         Iran     Tehran       21.60
CN        China     Bejing      175.60
RS       Russia     Mascow       67.20
NL        Nepal  Khatmundo       17.50
AF  Afghanistan      Kabul        9.67

In [24]:
f.loc['PK']

Country        Pakistan
Capital       Islamabad
Population         24.5
Name: PK, dtype: object

In [25]:
f['Country']

PK       Pakistan
IN          India
IR           Iran
CN          China
RS         Russia
NL          Nepal
AF    Afghanistan
Name: Country, dtype: object

In [27]:
f[['Country','Population']]

        Country  Population
PK     Pakistan       24.50
IN        India      127.40
IR         Iran       21.60
CN        China      175.60
RS       Russia       67.20
NL        Nepal       17.50
AF  Afghanistan        9.67

In [28]:
cur = ['Rupees','Rupees','Reyal','Yen','Russian Dollar','Rupees','Rupees']

In [29]:
type(cur)

list

In [30]:
df["Currency"] = cur

In [31]:
df

        Country    Capital  Population        Currency
PK     Pakistan  Islamabad       24.50          Rupees
IN        India      Delhi      127.40          Rupees
IR         Iran     Tehran       21.60           Reyal
CN        China     Bejing      175.60             Yen
RS       Russia     Mascow       67.20  Russian Dollar
NL        Nepal  Khatmundo       17.50          Rupees
AF  Afghanistan      Kabul        9.67          Rupees

In [32]:
new_row = {'Country':'USA','Capital':'Washington DC','Population':45.87,'Currency':'Dollar'}

In [34]:
df = df.append(new_row,ignore_index=True)

In [35]:
df

       Country        Capital  Population        Currency
0     Pakistan      Islamabad       24.50          Rupees
1        India          Delhi      127.40          Rupees
2         Iran         Tehran       21.60           Reyal
3        China         Bejing      175.60             Yen
4       Russia         Mascow       67.20  Russian Dollar
5        Nepal      Khatmundo       17.50          Rupees
6  Afghanistan          Kabul        9.67          Rupees
7          USA  Washington DC       45.87          Dollar

In [ ]:
new_df = pd.DataFrame(new_row)
df = pd.concat(new_df,df)

# CLASS ACTIVITY

'''

Registration, Name, Program, CGPA 

'''